oxhugo/blog/inbox.org
#+TITLE: 码农农场
#+STARTUP： content inlineimages
#+AUTHOR: Evilee
#+PROPERTY: header-args :eval no
#+LANGUAGE: zh-CN
#+OPTIONS: creator:t toc:nil
#+HUGO_BASE_DIR: ../../
#+HUGO_AUTO_SET_LASTMOD: f
#+HUGO_SECTION: blog
#+HUGO_CUSTOM_FRONT_MATTER: :authorbox true :comments true :toc false :mathjax true

* MacOS 系统上 Posgresql 的中文全文搜索配置和使用
:PROPERTIES:
:EXPORT_DATE: 2020-03-08
:EXPORT_FILE_NAME: textsearch-of-postgresql-on-macos
:END:

最近在做一个小方案，体验一下 PG 的全文搜索。由于我的工作环境是 MacOS, 所以记录一
下，等搞定了才发现这个跟 Linux 没多大区别。

<!--more-->

安装 postgresql
#+BEGIN_EXAMPLE
brew install postgresql
#+END_EXAMPLE

** pg_jieba 方案

安装
#+BEGIN_EXAMPLE
brew install cmake
mkdir ~/tmp && cd ~/tmp && git clone https://github.com/jaiminpan/pg_jieba && cd pg_jieba
git submodule update --init --recursive
mkdir build && cd build
cmake -DCMAKE_PREFIX_PATH=/usr/local/opt/postgres ..
make install
#+END_EXAMPLE

测试
#+BEGIN_EXAMPLE
$ psql -d vapordb
psql (12.2)
Type "help" for help.

@vapordb=# CREATE EXTENSION pg_jieba;
CREATE EXTENSION
@vapordb=# SELECT * FROM to_tsvector('jiebacfg', '小明硕士毕业于中国科学院计算所，后在日本京都大学深造');
                                   to_tsvector
----------------------------------------------------------------------------------
 '中国科学院':5 '小明':1 '日本京都大学':10 '毕业':3 '深造':11 '硕士':2 '计算所':6
(1 row)

@vapordb=# \quit
#+END_EXAMPLE

在测试时，可以感觉到 jieba 的第一次分词有明显的延迟和卡顿，可以通过 Postgresq 预
加载 jieba 的动态库和配置文件改善(/usr/local/var/postgres/postgresql.conf)。
#+BEGIN_EXAMPLE
#------------------------------------------------------------------------------
# CUSTOMIZED OPTIONS
#------------------------------------------------------------------------------

# Add settings for extensions here
# pg_jieba
shared_preload_libraries = 'pg_jieba.so'  # (change requires restart)
# default_text_search_config='pg_catalog.simple'; default value
default_text_search_config='jiebacfg'; uncomment to make 'jiebacfg' as default
#+END_EXAMPLE


** zhparser 方案
安装 scws
#+BEGIN_EXAMPLE
brew install scws
scws -v
#+END_EXAMPLE

下载词典文件
#+BEGIN_EXAMPLE
mkdir -p /usr/local/etc/scws
curl "http://www.xunsearch.com/scws/down/scws-dict-chs-utf8.tar.bz2" | tar xvjf -
mv dict.utf8.xdb /usr/local/etc/scws/
#+END_EXAMPLE

测试效果
#+BEGIN_EXAMPLE
scws -c utf8 -d /usr/local/etc/scws/dict.utf8.xdb -r /usr/local/opt/scws/etc/rules.utf8.ini -M 9 "PostgreSQL 自带有一个简易的全文检索引擎"
PostgreSQL 自带 自 带 有 一个 一 个 简易 简 易 的 全文检索 全文 检索 全 文 检 索 引擎 引 擎
+--[scws(scws-cli/1.2.3)]----------+
| TextLen:   52                  |
| Prepare:   0.0007    (sec)     |
| Segment:   0.0002    (sec)     |
+--------------------------------+
#+END_EXAMPLE

安装 zhparser
#+BEGIN_EXAMPLE
mkdir ~/tmp && cd ~/tmp
git clone https://github.com/amutu/zhparser.git && cd zhparser
make install
#+END_EXAMPLE

测试 zhparser
#+BEGIN_EXAMPLE
$ psql -d vapordb
psql (12.2)
Type "help" for help.

@vapordb=# CREATE EXTENSION zhparser;
CREATE EXTENSION
@vapordb=# CREATE TEXT SEARCH CONFIGURATION zhcnsearch (PARSER = zhparser);
CREATE TEXT SEARCH CONFIGURATION
@vapordb=# ALTER TEXT SEARCH CONFIGURATION zhcnsearch ADD MAPPING FOR n,v,a,i,e,l,j WITH simple;
ALTER TEXT SEARCH CONFIGURATION
@vapordb=# SELECT to_tsvector('zhcnsearch', '人生苦短，我用 Python');
               to_tsvector
------------------------------------------
 'python':5 '人生':1 '用':4 '短':3 '苦':2
(1 row)

@vapordb=# \quit
#+END_EXAMPLE

大功告成。

** 对比

两种方案效果上差不多.
#+BEGIN_EXAMPLE
$ psql -d vapordb
psql (12.2)
Type "help" for help.

@vapordb=# SELECT * FROM to_tsvector('jiebacfg', '小明硕士毕业于中国科学院计算所，后在日本京都大学深造');
                                   to_tsvector
----------------------------------------------------------------------------------
 '中国科学院':5 '小明':1 '日本京都大学':10 '毕业':3 '深造':11 '硕士':2 '计算所':6
(1 row)

@vapordb=# SELECT * FROM to_tsvector('zhcnsearch', '小明硕士毕业于中国科学院计算所，后在日本京都大学深造');
                                to_tsvector
---------------------------------------------------------------------------
 '中国科学院计算所':4 '小明':1 '日本京都大学':5 '毕业':3 '深造':6 '硕士':2
(1 row)

@vapordb=# \quit
#+END_EXAMPLE

** 如何使用
对于全文检索，有两种使用方式，大家可以权衡自己的内容进行选择。
1. 在搜索的时候进行分词，然后搜索对应的字段。
2. 提前把表中需要检索的字段进行分词，保存到一个新的字段中，再在这个字段上建立索
   引进行搜。
两种方案就是时间和空间的取舍：第一种方式创建索引简单，存储空间少，但是比较慢。第
二种方案由于预先进行了分词并存储，浪费了空间，但是时间上肯定用得少。创建索引也有
两种方案：gin 索引和 rum 索引。

*** 第一种
创建索引:
#+BEGIN_SRC sql
CREATE INDEX idx_xxxx ON xxxx_table USING gin(to_tsvector('jiebacfg',
COALESCE(xx_field, '') || COALESCE(xxx_field, '')));
#+END_SRC

查询：
#+BEGIN_SRC sql
EXPLAIN ANALYSE SELECT * FROM xxxx_table
        WHERE to_tsvector('jiebacfg', COALESCE(xx_field, '') || COALESCE(xxx_field, '')) @@
        to_tsquery('jiebacfg', '关键字或者句子');
#+END_SRC

*** 第二种
创建 tsv 字段和索引
#+BEGIN_SRC sql
ALTER TABLE xxxx_table ADD COLUMN tsv tsvector;
UPDATE xxxx_table SET tsv_field = to_tsvector('jiebacfg', COALESCE(xx_field, '') || COALESCE(xxx_field, ''));
CREATE INDEX idx_xxxx ON xxxx_table USING gin(tsv_field);
#+END_SRC

查询：
#+BEGIN_SRC sql
EXPLAIN ANALYSE SELECT * FROM xxxx_table WHERE tsv_field @@ to_tsquery('jiebacfg', '关键词或者句子');
#+END_SRC
当然因为是预先分词保存，所以需要在 update 的时候藉由 =触发器= 来更新 tsv 字段，。
#+BEGIN_SRC sql
CREATE TRIGGER tsvector_update BEFORE INSERT OR UPDATE
       ON xxxx_table FOR EACH ROW  EXECUTE PROCEDURE tsvector_update_trigger('tsv_field', 'jiebacfg', 'xx_field', 'xxx_field');
#+END_SRC

*** rum 索引
使用 rum 索引类似, 但是 rum 引擎默认是没有安装的，需要自己编译，暂时先不用了。

#+BEGIN_SRC sql
CREATE INDEX idx_xxxx ON xxxx_table USING rum(tsv_field rum_tsvector_ops);
#+END_SRC

另外 rum 还支持相似度的查询:
#+BEGIN_SRC sql
SELECT * FROM to_tsvector('jiebacfg', '小明硕士毕业于中国科学院计算所，后在日本京都大学深造');
SELECT * FROM rum_ts_distance(to_tsvector('jiebacfg', '小明硕士毕业于中国科学院计算所，后在日本京都大学深造') , to_tsquery('计算所'));
#+END_SRC

